Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: If you compile in unchecked mode (-Ounchecked), preconditions aren’t checked.
ja: あなたが未検査モード（-Ounchecked）でコンパイルするならば、前提条件は調べられません。

source: If you create a CartItem instance with a nonempty name and a quantity of 1 or more, initialization succeeds:
ja: あなたがCartItemインスタンスを空でない名前と1以上の数量で作成するならば、初期化は成功します：

source: If you create a TrackedString instance and modify its string value a few times, you can see the numberOfEdits property value update to match the number of modifications:
ja: あなたがTrackedStringインスタンスをつくって、２、３回その文字列値を修正するならば、あなたはnumberOfEditsプロパティが修正の数に合うように更新されるのを見ることができます：

source: If you create a new Person instance, its residence property is default initialized to nil, by virtue of being optional.
ja: あなたが新しいPersonインスタンスをつくるならば、そのresidenceプロパティは、オプショナルである長所によって、省略時でnilに初期化されます。

source: If you create a new String value, that String value is copied when it’s passed to a function or method, or when it’s assigned to a constant or variable.
ja: あなたが新しいString値をつくるならば、そのString値は、それが関数またはメソッドに渡される時に、またはそれが定数または変数に代入される時に、コピーされます。

source: If you create a new instance of Train and call its makeNoise() method, you can see that the Train subclass version of the method is called:
ja: あなたがTrainの新しいインスタンスを作成してそれのmakeNoise()メソットを呼び出すならば、あなたはサブクラス板のTrainメソッドが呼び出されるのを見ることができます。

source: If you create a second incrementer, it will have its own stored reference to a new, separate runningTotal variable:
ja: あなたが第２のインクリメンタをつくるならば、それは、独自に格納された、ある新しい、別個のrunningTotal変数への参照を持ちます：

source: If you create a second player, whom you try to move to a level that is not yet unlocked by any player in the game, the attempt to set the player’s current level fails:
ja: あなたが二番目のプレーヤーを作成して、あなたがその人をそのゲームにおいてどのプレーヤーによってもまだ錠を開けられていないレベルへ動かそうとするならば、プレーヤーの現在のレベルを決めるその試みは失敗します：

source: If you create an array, a set, or a dictionary, and assign it to a variable, the collection that is created will be mutable.
ja: あなたがある配列、集合、または辞書を作成して、それをある変数に代入したならば、作成されたコレクションは可変となります。

source: If you create an instance of Bicycle, you can call its inherited description computed property to see how its numberOfWheels property has been updated:
ja: あなたがBicycleのインスタンスを作成するならば、あなたはそれの継承されたdescription計算プロパティを呼び出して、どのようにそれのnumberOfWheelsプロパティが更新されたか見ることができます：

source: If you create an instance of Tandem, you can work with any of its new and inherited properties, and query the read-only description property it inherits from Vehicle:
ja: あなたがTandemのインスタンスを作成するならば、あなたはそれの新規および継承するプロパティを扱うことができて、それがVehicleから継承する読み込み専用のdescriptionプロパティについて問い合わせることができます：

source: If you create an instance of a structure and assign that instance to a constant, you cannot modify the instance’s properties, even if they were declared as variable properties:
ja: あなたが構造体のインスタンスをつくって、そのインスタンスを定数に代入するならば、あなたはそのインスタンスのもつプロパティを、たとえそれらが変数プロパティとして宣言されたとしても、修正することはできません：

source: If you create an instance of the Car class and set its gear and currentSpeed properties, you can see that its description property returns the tailored description defined within the Car class:
ja: あなたがCarクラスのインスタンスを作成して、それのgearとcurrentSpeedプロパティを設定するならば、あなたはそれのdescriptionプロパティがCarクラス内で定義される特注の説明を返すのを見ることができます：

source: If you create and assign an actual Residence instance to john.residence, with one or more Room instances in its rooms array, you can use the Residence subscript to access the actual items in the rooms array through optional chaining:
ja: あなたが実際のResidenceインスタンスをつくってjohn.residenceに代入して、そのrooms配列の中に１つ以上のRoomインスタンスをもつならば、あなたはResidence添え字を使って、オプショナル連鎖を通してrooms配列の実際の項目にアクセスすることができます。

source: If you create your own class or structure to represent a complex data model, for example, then the meaning of “equal to” for that class or structure isn’t something that Swift can guess for you.
ja: あなたが例えば独自のクラスまたは構造体を作成してある複合データモデルを表すならば、そのときそのクラスまたは構造体のための「同等」の意味することはスウィフトがあなたのために推測することができる何かではありません。

source: If you define a new protocol that inherits from an existing protocol, the new protocol can have at most the same access level as the protocol it inherits from.
ja: あなたが既存のプロトコルから継承する新しいプロトコルを定義するならば、新しいプロトコルは最大ではそれが継承するプロトコルと同じアクセス水準を持つことができます。

source: If you define a protocol instance method requirement that is intended to mutate instances of any type that adopts the protocol, mark the method with the mutating keyword as part of the protocol’s definition.
ja: あなたがそのプロトコルを採用するあらゆる型のインスタンスを変化させることを意図したインスタンスメソッド要件プロトコルを定義するならば、プロトコルの定義の一部としてそのメソッドにmutatingキーワードで印をつけてください。

source: If you define a public protocol, the protocol’s requirements require a public access level for those requirements when they’re implemented.
ja: あなたがある公開プロトコルを定義するならば、そのプロトコルの持つ要件は、それら要件に対してそれらが実装されるときに公開アクセス水準を必要とします。

source: If you define a type’s access level as internal or public (or use the default access level of internal without specifying an access level explicitly), the default access level of the type’s members will be internal.
ja: あなたがある型のアクセス水準を内部または公開として定義する（または明示的にアクセス水準を指定することなく省略時のアクセス水準である内部を使用する）ならば、その型のメンバーの省略時のアクセス水準は内部になります。

source: If you define a type’s access level as private or file private, the default access level of its members will also be private or file private.
ja: あなたがある型のアクセス水準を非公開またはファイル外非公開として定義するならば、そのメンバーの省略時のアクセス水準も、非公開またはファイル外非公開になります。

source: If you define an enumeration with a raw-value type, the enumeration automatically receives an initializer that takes a value of the raw value’s type (as a parameter called rawValue) and returns either an enumeration case or nil.
ja: あなたが列挙を「生の値」型を使って定義したならば、その列挙は生の値の方の値を（rawValueと呼ばれるパラメーターとして）とって、１つの列挙ケース節かnilのどちらかを返すイニシャライザを自動的に受け取ります。

source: If you define an extension to add new functionality to an existing type, the new functionality will be available on all existing instances of that type, even if they were created before the extension was defined.
ja: あなたが新しい機能性を既存の型に加えるために拡張を定義するならば、新しい機能性はその型の全ての既存の例で利用可能になります、たとえそれらが拡張が定義される前につくられたとしてもです。

source: If you define an optional variable without providing a default value, the variable is automatically set to nil for you:
ja: あなたが既定値を提供することなくオプショナルの変数を定義するならば、その変数はあなたのために自動的にnilに設定されます：

source: If you didn’t mark the parameter of this function with @escaping, you would get a compile-time error.
ja: あなたがこの関数のパラメータを@escapingで印しないならば、あなたはコンパイル時エラーを得るでしょう。

source: If you do not provide a setter name, the default parameter name to the setter is newValue, as described in Shorthand Setter Declaration.
ja: あなたがセッター名を提供しないならば、短縮形セッター宣言で記述されるように、セッターへの省略時のパラメータ名はnewValueです。

source: If you do not provide a setter name, the default parameter name to the setter is value.
ja: あなたがセッター名を提供しないならば、セッターへの省略時のパラメータ名はvalueです。

source: If you do not provide setter names, the default parameter name to the willSet observer is newValue and the default parameter name to the didSet observer is oldValue.
ja: あなたがセッター名を提供しないならば、willSetオブザーバーへの初期状態でのパラメータ名はnewValueです、そして、didSetオブザーバーへの初期状態でのパラメータ名はoldValueです。

source: If you do not want to use an argument label for an initializer parameter, write an underscore (_) instead of an explicit argument label for that parameter to override the default behavior.
ja: あなたがイニシャライザ・パラメータのために引数ラベルを使うことを望まないならば、そのパラメータに対して明示的な引数ラベルを書くのではなくひとつのアンダーバー（_）を書いて、省略時の挙動をオーバーライドしてください。

source: If you don’t explicitly write self, Swift assumes that you are referring to a property or method of the current instance whenever you use a known property or method name within a method.
ja: あなたが明示的にselfを書かないならば、スウィフトは、あなたがメソッド内で既知のプロパティまたはメソッド名を使用するときはいつでも、あなたが現在のインスタンスに属するプロパティまたはメソッドに言及していると仮定します。

source: If you don’t need each value from a sequence, you can ignore the values by using an underscore in place of a variable name.
ja: あなたがある連続物からの各値を必要としないならば、あなたは変数の名前の代わりにアンダースコアを使うことによってその値を無視することができます。

source: If you don’t need to compute the property but still need to provide code that is run before and after setting a new value, use willSet and didSet.
ja: あなたが、プロパティを計算する必要がないにもかかわらず新しい値の設定の前や後で実行されるコードを提供する必要があるならば、willSetやdidSetを使ってください。

source: If you don’t provide an initial value when you declare an optional variable or property, its value automatically defaults to nil.
ja: オプショナルの変数またはプロパティを宣言する時にあなたが最初の値を提供しないならば、その値は自動的に省略時のnilになります。

source: If you don’t specify the type of value you need, Swift uses type inference to work out the appropriate type.
ja: あなたが必要とする値の型をあなたが指定しないならば、スウィフトは適切な型を導きだすために型推論を使います。

source: If you don’t use this attribute, supply a main.swift file with code at the top level that calls the UIApplicationMain(_:_:_:_:) [https://developer.apple.com/documentation/uikit/1622933-uiapplicationmain] function.
ja: あなたがこの属性を使わないならば、UIApplicationMain(_:_:_:_:) [https://developer.apple.com/documentation/uikit/1622933-uiapplicationmain]関数を呼ぶトップレベルでのコードを持つmain.swiftファイルを提供してください。

source: If you don’t use this attribute, supply a main.swift file with code at the top level that calls the NSApplicationMain(_:_:) function as follows:
ja: あなたがこの属性を使わないならば、NSApplicationMain(_:_:)関数を呼ぶトップレベルコードを持つmain.swiftファイルを以下のように提供してください：

source: If you don’t want an argument label for a parameter, write an underscore (_) instead of an explicit argument label for that parameter.
ja: あなたがあるパラメーターに引数ラベルを使うことを望まないならば、そのパラメーターに対して明示的な引数ラベルの代わりにひとつのアンダースコア（_）を書いてください。

source: If you don’t want to modify the inherited property’s value within the overriding getter, you can simply pass through the inherited value by returning super.someProperty from the getter, where someProperty is the name of the property you are overriding.
ja: あなたがオーバーライドのゲッター内で継承されたプロパティの値を修正したくないならば、あなたは、そのゲッターからsuper.somePropertyを返すことによって、単に継承された値を通り抜けさせることができます、ここでsomePropertyはあなたがオーバーライドしているプロパティの名前です。

source: If you don’t write the parameter name and parentheses within your implementation, the parameter is made available with a default parameter name of newValue.
ja: あなたがパラメータ名と丸括弧をあなたの実装内で書かないならば、パラメータは省略時のパラメータ名のnewValueを使って利用可能にされます。

source: If you extend a file-private type, any new type members you add have a default access level of file private.
ja: あなたがあるファイル外非公開型を拡張するならば、あなたが加えるどんな新しい型メンバーでも省略時のアクセス水準であるファイル外非公開を持ちます。

source: If you extend a private type, any new type members you add have a default access level of private.
ja: あなたがある非公開型を拡張するならば、あなたが加えるどんな新しい型メンバーでも省略時のアクセス水準である非公開を持ちます。

source: If you extend a public or internal type, any new type members you add have a default access level of internal.
ja: あなたがある公開または内部型を拡張するならば、あなたが加えるどんな新しい型メンバーでも省略時のアクセス水準である内部を持ちます。

source: If you group together aspects of your app’s code as a stand-alone framework—perhaps to encapsulate and reuse that code across multiple applications—then everything you define within that framework will be part of a separate module when it’s imported and used within an app, or when it’s used within another framework.
ja: あなたが、あなたのアプリのコードのさまざまな面をスタンドアローンのフレームワークとして ― おそらくそのコードをカプセル化して複数のアプリケーションに渡って再利用するために ― １つにまとめるならば、あなたがそのフレームワーク内で定義するすべてのものは、それがアプリ内にインポートされて使われるとき、またはそれがもう１つのフレームワーク内で使われるとき、別々のモジュール部分になります。

source: If you have conflicting access to memory from within a single thread, Swift guarantees that you’ll get an error at either compile time or runtime.
ja: あなたがシングルスレッド内部からのメモリアクセス衝突を起こしているならば、スウィフトはコンパイル時または実行時のどちらかであなたがエラーを得るのを保証します。

source: If you have experience with C, C++, or Objective-C, you may know that these languages use pointers to refer to addresses in memory.
ja: あなたがC、C++、またはObjective-Cで経験を持つならば、あなたはこれらの言語がメモリのアドレスに言及するためにポインターを使用するということを知っているかもしれません。

source: If you have experience with Objective-C, you may know that it provides two ways to store values and references as part of a class instance.
ja: あなたがObjective-Cでの経験を持つならば、あなたはそれがクラスインスタンスの一部として値や参照を格納するために２つの方法を提供するということを知っているかもしれません。

source: If you have written code in C or Objective-C, this syntax looks familiar to you—in Swift, this line of code is a complete program.
ja: あなたがCまたはObjective-Cでコードを書いたことがあるならば、この構文はあなたにとって馴染みがあるものでしょう ― スウィフトにおいて、コードのこの行は、ひとつの完全なプログラムです。

source: If you implement a willSet observer, it’s passed the new property value as a constant parameter.
ja: あなたがwillSetオブザーバーを実装するならば、それは新しいプロパティ値を定数パラメータとして渡されます。

source: If you implement both dynamicallyCall methods, dynamicallyCall(withKeywordArguments:) is called when the method call includes keyword arguments.
ja: あなたが両方のdynamicallyCallメソッドを実装するならば、dynamicallyCall(withKeywordArguments:)が呼び出されるのは、メソッド呼び出しがキーワード引数を含む時です。

source: If you implement the Togglable protocol for a structure or enumeration, that structure or enumeration can conform to the protocol by providing an implementation of the toggle() method that is also marked as mutating.
ja: あなたがTogglableプロトコルをある構造体または列挙のために実装するならば、その構造体または列挙は、同様にmutatingとして印されるtoggle()メソッドの実施を提供することによって、このプロトコルに準拠できます。

source: If you mark a protocol instance method requirement as mutating, you don’t need to write the mutating keyword when writing an implementation of that method for a class.
ja: あなたがインスタンスメソッド要件プロトコルにmutatingとして印するならば、あるクラスのためにそのメソッドの実装を書くとき、あなたはmutatingキーワードを書く必要がありません。

source: If you mark an initializer with the required declaration modifier, you don’t also mark the initializer with the override modifier when you override the required initializer in a subclass.
ja: あなたがイニシャライザをrequired宣言修飾子で印するならば、あなたはさらにそのイニシャライザをoverride宣言修飾子で印することは、あなたがサブクラスの必須イニシャライザをオーバーライドする場合には、しません。

source: If you name the elements in a tuple, you can use the element names to access the values of those elements:
ja: あなたがタプルの要素に名をつけるならば、あなたはそれらの要素の値にアクセスするために要素名を使用することができます：

source: If you need C-style fallthrough behavior, you can opt in to this behavior on a case-by-case basis with the fallthrough keyword.
ja: あなたがC形式のフォールスルー挙動を必要とするならば、あなたはfallthroughキーワードを使ってそれぞれ個別にこの挙動を選択できます。

source: If you need a string that spans several lines, use a multiline string literal—a sequence of characters surrounded by three double quotation marks:
ja: あなたがいくつかの行に及ぶ文字列を必要とするならば、複数行文字列リテラル — ３つの二重引用符で囲まれる一連の文字、を使ってください：

source: If you need a type to conditionally conform to two protocols that inherit from a single parent, explicitly declare conformance to the parent protocol.
ja: あなたがある型に単一の親から継承する２つのプロトコルに対して条件準拠して欲しいならば、明示的に親プロトコルに対する準拠を宣言してください。

source: If you need the behavior of the swapTwoValues(_:_:) function in your own code, you can use Swift’s existing swap(_:_:) function rather than providing your own implementation.
ja: あなたがあなた自身のコードにおいてswapTwoValues(_:_:)関数の挙動を必要とするならば、あなたはあなた自身の実施を提供するのではなくスウィフトの既存のswap(_:_:)関数を使用することができます。

source: If you need the integer index of each item as well as its value, use the enumerated() method to iterate over the array instead.
ja: あなたがその値のみならず各項目の整数インデックスを必要とするならば、代わりにenumerated()メソッドを配列じゅうを繰り返し処理するのに使ってください。

source: If you need the special effects of a character in a string literal, match the number of number signs within the string following the escape character (\).
ja: あなたが文字列リテラルの中のある文字の特別な効果を必要とするならば、文字列内のエスケープ文字（\）に続くシャープ記号の数を一致させてください。

source: If you need to add conditional conformance based on multiple concrete types, create a new protocol that each type can conform to and use that protocol as the requirement when declaring conditional conformance.
ja: あなたが複数の具象型に基づく条件準拠を加える必要があるならば、それぞれの型が準拠できる新しいプロトコルを作成してください、そしてそのプロトコルを条件準拠を宣言する時に要件として使ってください。

source: If you need to avoid this restriction, mark one of the parameters as escaping, or temporarily convert one of the nonescaping function parameters to an escaping function by using the withoutActuallyEscaping(_:do:) function.
ja: あなたがこの規制を回避する必要があるならば、パラメータの１つを脱出すると印してください、または一時的に非脱出関数パラメータの１つを脱出関数へとwithoutActuallyEscaping(_:do:)関数を使うことによって変換してください。

source: If you need to capture an in-out parameter without mutating it or to observe changes made by other code, use a capture list to explicitly capture the parameter immutably.
ja: あなたがin-outパラメータをキャプチャする必要がそれを変化させることなしにまたは他のコードによってなされる変更を監視するためにあるならば、キャプチャリストを使うことで明示的にそのパラメータを不変にキャプチャしてください。

source: If you need to capture and mutate an in-out parameter, use an explicit local copy, such as in multithreaded code that ensures all mutation has finished before the function returns.
ja: あなたがin-outパラメータをキャプチャして変化させる必要があるならば、明示的なローカルコピーを使ってください、例えばすべての変化がその関数が返るまえに完了してしまっていることを保証するマルチスレッド化されたコードにおいてなど。

source: If you need to convert a value to a different type, explicitly make an instance of the desired type.
ja: あなたがある値を異なる型に変換する必要があるならば、明示的に望む型のインスタンスにしてください。

source: If you need to expose many declarations, you can group them in an extension that has the objc attribute.
ja: あなたが多くの宣言を露出する必要があるならば、あなたはそれらをobjc属性を持つある拡張にまとめることができます。

source: If you need to give a constant or variable the same name as a reserved Swift keyword, surround the keyword with backticks (`) when using it as a name.
ja: あなたが予約済みのスウィフトのキーワードと同じ名前を定数または変数に与える必要があるならば、名前としてそれを使うときバッククォート（`）でそのキーワードを囲んでください。

source: If you need to pass a closure expression to a function as the function’s final argument and the closure expression is long, it can be useful to write it as a trailing closure instead.
ja: あなたが関数の最後の引数としてクロージャ式を関数に渡す必要がある、そして、クロージャ式が長いならば、代わりに後付クロージャとしてそれを書くことは役に立つことがありえます。

source: If you need to use a dictionary’s keys or values with an API that takes an Array instance, initialize a new array with the keys or values property:
ja: あなたが、ある辞書のキーまたは値を、Arrayインスタンスを引数にとるAPIで使う必要があるならば、keysまたはvaluesプロパティによってひとつの新しい配列を初期化してください：

source: If you omit the argument, the name used in Objective-C code matches the name in Swift code, and the runtime name follows the normal Swift compiler convention of name mangling.
ja: あなたが引数を省略するならば、Objective-Cコードにおいて使われる名前はSwiftコードにおける名前と合致します、そしてランタイム名は名前修飾の通常のSwiftコンパイラ慣例に従います。

source: If you omit the parameter names and both types, omit the in keyword before the statements.
ja: あなたがパラメータ名と両方の型を省略するならば、文の前のinキーワードを省略します。

source: If you omit the precedence group for an operator, Swift uses the default precedence group, DefaultPrecedence, which specifies a precedence just higher than TernaryPrecedence.
ja: あなたが優先順位グループを省略するならば、スウィフトは省略時の優先順位グループ、DefaultPrecedenceを使います、それはTernaryPrecedenceのすぐ上の優先順位を指定します。

source: If you omit the version number, omit the colon (:) as well.
ja: あなたがこのバージョン番号を省略したならば、コロン（:）も同様に省いてください。

source: If you omit these parentheses, you are trying to assign the closure itself to the property, and not the return value of the closure.
ja: あなたがこの丸括弧を省略するならば、あなたはプロパティにクロージャそれ自体を代入することを試みています、つまりそのクロージャの戻り値でなく。

source: If you only need some of the tuple’s values, ignore parts of the tuple with an underscore (_) when you decompose the tuple:
ja: あなたがタプルの値の一部を必要とするだけならば、あなたがタプルを分解するとき、アンダースコア（_）で、タプルの一部を無視してください：

source: If you pass a property that has observers to a function as an in-out parameter, the willSet and didSet observers are always called.
ja: あなたがオブザーバーを持つプロパティをある関数へin-outパラメータとして渡すならば、willSetとdidSetオブザーバーは常に呼び出されます。

source: If you pass an empty string value to the failable initializer’s species parameter, the initializer triggers an initialization failure:
ja: あなたが失敗できるイニシャライザのspeciesパラメータに空の文字列値を渡すならば、イニシャライザは初期化失敗を引き起こします：

source: If you provide a new initializer with an extension, you are still responsible for making sure that each instance is fully initialized once the initializer completes.
ja: あなたが新しいイニシャライザを拡張によって提供する場合、あなたは依然として、一旦イニシャライザが完了するならば各インスタンスが完全に初期化されることを確かにする責任があります。

source: If you provide a setter as part of a property override, you must also provide a getter for that override.
ja: あなたがプロパティオーバーライドの一部としてセッターを提供するならば、あなたはまたそのオーバーライドのためにゲッターも提供しなければなりません。

source: If you provide a setter name, it is used as the name of the parameter to the setter.
ja: あなたがセッター名を提供するならば、それがセッターにパラメータの名前として使われます。

source: If you provide an initial value for a constant or variable at the point that it’s defined, Swift can almost always infer the type to be used for that constant or variable, as described in Type Safety and Type Inference.
ja: あなたが最初の値を定数または変数に、それが定義される時点で提供するならば、スウィフトはたいていその定数または変数のために使われる型を推測することが、「型安全と型推論」で記述されるように可能です。

source: If you provide setter names, they are used as the parameter names to the willSet and didSet observers.
ja: あなたがセッター名を提供するならば、それらがwillSetとdidSetオブザーバーへのパラメータ名として使われます。

source: If you read strictly from left to right, you might expect the expression to be calculated as follows:
ja: あなたが厳密に左から右に読んだならば、あなたはこの式を以下のように計算されることを期待するでしょう：

source: If you really do need to use an optional value as an Any value, you can use the as operator to explicitly cast the optional to Any, as shown below.
ja: あなたが本当にオプショナル値をAny値として使う必要があるならば、あなたはas演算子を使って明示的にオプショナルをAnyへキャストすることが、以下で示すように行えます。

source: If you set an actual Address instance as the value for john.residence.address, and set an actual value for the address’s street property, you can access the value of the street property through multilevel optional chaining:
ja: あなたが実際のAddressインスタンスをjohn.residence.addressのための値として設定して、そしてアドレスのもつstreetプロパティのために実際の値を設定するならば、あなたは複数階層のオプショナル連鎖を通してstreetプロパティの値にアクセスすることができます：

source: If you set the currentLevel of the left channel to 7, you can see that the maxInputLevelForAllChannels type property is updated to equal 7:
ja: あなたが左のチャンネルのcurrentLevelを7に設定するならば、あなたは型プロパティmaxInputLevelForAllChannelsが7に等しくなるよう更新されるのを見ることができます：

source: If you set the paragraph variable to nil and break its strong reference to the HTMLElement instance, neither the HTMLElement instance nor its closure are deallocated, because of the strong reference cycle:
ja: あなたがparagraph変数をnilに設定して、HTMLElementへのそれの強い参照を壊すならば、HTMLElementインスタンスもそれのクロージャも割り当て解除されません、強い参照循環のためです：

source: If you set the strong reference from the paragraph variable to nil, the HTMLElement instance is deallocated, as can be seen from the printing of its deinitializer message in the example below:
ja: あなたが強い参照であるparagraph変数をnilに設定するならば、そのHTMLElementインスタンスは、下の例におけるそれのデイニシャライザのメッセージの出力から分かるように、割り当て解除されます：

source: If you specify a name by passing an argument, that name is used as the name in Objective-C code and as the runtime name.
ja: あなたが名前を引数を渡す事によって指定するならば、その名前はObjective-Cコードにおける名前としてそしてランタイム名として使われます。

source: If you specify a type by name, you can access the type’s initializer without using an initializer expression.
ja: あなたがある型を名前で指定するならば、あなたはその型のイニシャライザにイニシャライザ式を使うことなくアクセスすることができます。

source: If you specify the Objective-C name for a class, protocol, or enumeration, include a three-letter prefix on the name, as described in Conventions [https://developer.apple.com/library/content/documentation/Cocoa/Conceptual/ProgrammingWithObjectiveC/Conventions/Conventions.html#//apple_ref/doc/uid/TP40011210-CH10-SW1] in Programming with Objective-C [https://developer.apple.com/library/content/documentation/Cocoa/Conceptual/ProgrammingWithObjectiveC/Introduction/Introduction.html#//apple_ref/doc/uid/TP40011210].
ja: あなたがObjective-C名をクラス、プロトコル、または列挙に指定するならば、ある３文字接頭辞をその名前に含めて下さい、Conventions [https://developer.apple.com/library/content/documentation/Cocoa/Conceptual/ProgrammingWithObjectiveC/Conventions/Conventions.html#//apple_ref/doc/uid/TP40011210-CH10-SW1]でProgramming with Objective-C [https://developer.apple.com/library/content/documentation/Cocoa/Conceptual/ProgrammingWithObjectiveC/Introduction/Introduction.html#//apple_ref/doc/uid/TP40011210]において記述されるように。

source: If you subtract 1 from 00000000 using the overflow subtraction operator (&-), the number will overflow and wrap around to 11111111, or 255 in decimal.
ja: あなたがオーバフロー減算演算子（&-）を使用して00000000から1を減ずるならば、その数はあふれ出てぐるっと送り込まれて11111111、10進での255になります。

source: If you throw an error in a function, the function returns immediately and the code that called the function handles the error.
ja: あなたが関数においてエラーをスローするならば、その関数は直ちに返ります、そして関数を呼んだコードがエラーを取り扱います。
